app/controllers/comments_controller.rb

INSERT INTO `comments` (`updated_at`, `body`, `username`, `post_id`, `created_at`) VALUES('2009-04-08 17:39:36', 'dsadasds', 'dsads', NULL, '2009-04-08 17:39:36')
---
  def create
    if @comment = @post.comments.create(params[:comment])