app/controllers/posts_controller.rb

INSERT INTO `posts` (`updated_at`, `body`, `subject`, `user_id`, `created_at`) VALUES('2009-04-20 00:15:42', 'This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. This is a test post. ', 'This is a test post', NULL, '2009-04-20 00:15:42')
---
  def create
    @current_user.posts.create(params[:post])