app/controllers/sessions_controller.rb

SELECT * FROM `posts` ORDER BY created_at DESC LIMIT 5
---
  def new
      @posts = Post.all(:order => "created_at DESC", :limit => 5)