app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `activated_at`, `crypted_password`, `deleted_at`, `remember_token_expires_at`, `activation_code`, `remember_token`, `login`, `email`, `created_at`, `state`) VALUES('', '971e352bfe98379520ecdf94fbed358b91be7e0e', '2009-04-08 12:44:41', NULL, '2de89174530a7a02d92cc6b17a55891d9a83dac2', NULL, NULL, '851ce09293936e2732958124bb2e481bee50c0cf', NULL, 'justin', 'justinbeck@mac.com', '2009-04-08 12:44:41', 'pending')
---
  def create
    @user = User.new(params[:user])
    if @user.save