app/controllers/users_controller.rb

  def new
    @posts = Post.all
---
SELECT * FROM `posts`

  def find_user
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1